ywtgogo/sd_mk24n256/project_wifi/protocol/uart_ppp.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#define PR_MODULE "ppp\1"

/* FreeRTOS kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"

/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"

#include "fsl_uart_freertos.h"
#include "fsl_uart.h"
#include "fsl_port.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "pppif.h"
#include "ppp.h"
#include "modem_socket.h"
#include "board.h"
#include "netif.h"
#include "lwip/dns.h"
#include "lwip/tcpip.h"
#include "ppp.h"
#include "uart_ppp.h"
#include "hbb_config.h"
#include "fsl_adc16.h"
#include "uplink_protocol.h"
#include "hb_protocol.h"
#include "log_task.h"
#include "mqtt_task.h"
#include "json.h"
#include "fota.h"

/*******************************************************************************
 * Variables
 ******************************************************************************/
extern u32_t aging_test_for_ppp;
uint8_t ppp_background_buffer[2048];
uart_rtos_handle_t ppp_handle;
SemaphoreHandle_t call_http_mqtt_sem;				/*	*/
struct _uart_handle ppp_t_handle;
const char *send_ring_overrun = "\r\nRing buffer overrun!\r\n";
const char *send_hardware_overrun = "\r\nHardware buffer overrun!\r\n";

struct rtos_uart_config modem_uart_config = {
    .baudrate = 115200,
    .parity = kUART_ParityDisabled,
    .stopbits = kUART_OneStopBit,
    .buffer = ppp_background_buffer,
    .buffer_size = sizeof(ppp_background_buffer),
};

u32_t next_seq_no = 0;
u32_t ppp_pd = 0;
u32_t bat_adc_counter = 0;
u32_t bat_adc_shut_counter = 0;
uint32_t bat_volt_low_flag = 0;
u32_t power_ac_dc_status = 1;
u32_t sos_incoming_call_status = 0;
u32_t sim_status = 0;
SEQ_TBL  * seq_func_g;
u8_t ppp_temp_recved;
u8_t ppp_rec[1];

ppp_gprs_info_conf ppp_gprs_info = {
	.ppp_relink_count = 0,
	.ppp_gprs_timer_counter = 0,
	.ppp_gprs_current_seq = SEQ_001,
	.ppp_gprs_current_status = K24_STATUS_LIVE,
	.ppp_uart_current_counter = 1,
	.ppp_uart_old_counter = 0,
	.ppp_uart_timer_counter = 0,
	.ppp_uart_current_status = K24_UART_STATUS_LIVE,
	.http_ask_ppp_to_negotiate = 0,
	.modem_need_at_mode = 0,
	.modem_need_apn_update = 0,
	.modem_need_sos_update = 0,
	.irq_for_sms_or_incoming_call = NO_SMS_OR_INCOMING_CALL,
	.irq_for_sos_call = SOS_NO_CALL,
	.ppp_modem_init_flag = 1,
	.incoming_call_answer_timeout = 27,
	
	.gprs_apn = "\"sl3gnet\"\r",
	.ppp_pap_user = "sladmin",
	.ppp_pap_passwd = "slpasswd",
	.sos_call = "112\r",
	.sms_max_number_me = 50,
	.sms_current_number_me = 30,
};

ppp_gprs_apn_pap_info_conf ppp_gprs_apn_pap_info = {
	.gprs_apn = "\"sl3gnet\"\r",
	.ppp_pap_user = "sladmin",
	.ppp_pap_passwd = "slpasswd",
	.sos_call = "112\r",
	.incoming_call_answer_timeout = 27,
	.sms_max_number_me = 50,
	.sms_curr_number_me = 30,
};

#ifdef CPU_MK24FN256VDC12

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
extern CHAR at_cmd_sos_call[32];
extern void lwip_init(void);
extern void pppInit(void);
extern void ppp_state_callback(void *ctx, int errCode, void *arg);
extern void pppos_input(int pd, u_char* data, int len);
extern err_t pppifNetifInit(struct netif *netif);
extern int sifdown(int pd);
extern void sync_gprs_info();
extern int defer_log_uplink();
/*******************************************************************************
 * Code
 ******************************************************************************/
/*
*hao.yunran
*2017.1.6
*
*/
u32_t update_sos_call_number(CHAR* sos_number)
{
	u32_t ret = AT_RET_OK;
	u32_t sos_len = 0;

	sos_len = strlen(sos_number);
	if(sos_len > 32)
	{
		return AT_RET_FAIL;
	}
	memset(&ppp_gprs_apn_pap_info.sos_call, 0, sizeof(ppp_gprs_apn_pap_info.sos_call));
	strncpy(ppp_gprs_apn_pap_info.sos_call, sos_number, sos_len);
	memset(&at_cmd_sos_call, 0, sizeof(at_cmd_sos_call));
	
	sprintf(at_cmd_sos_call,"ATD%s\r", sos_number);

	PRINTF("..update_sos_call_number..%s\r\n",at_cmd_sos_call);	
	sync_gprs_info();
	return ret;
}

/*
*hao.yunran
*2017.1.6
*
*/
u32_t update_incoming_call_auto_answer_timeout(u32_t timeout)
{
	u32_t ret = AT_RET_OK;
	PRINTF("..update_incoming_call_auto_answer_timeout..%d\r\n",timeout);	
	ppp_gprs_apn_pap_info.incoming_call_answer_timeout = timeout;
	sync_gprs_info();
	return ret;
}

/*
*hao.yunran
*2017.1.6
*
*/
u32_t update_power_info(DATA_INFO *data_info, DATA_ITEM_STRUCT *data_item)
{
	u32_t Adc16_Value = 0;
	u32_t nPG_Value = 0;
	char format[] = "\"10201/vt:%d,10302/s:%s\"";

