ywtgogo/sd_mk24n256/project_wifi/protocol/uart_ppp.c
	if((Adc16_Value = BAT_adc_read()) > BAT_ADC_NOR_VALUE)
		return AT_RET_FAIL;

	if((nPG_Value = BAT_nPG_READ()) == 0x1)
		sprintf(data_item->info, format, (Adc16_Value*100)/BAT_ADC_NOR_VALUE, "AC");
	else
		sprintf(data_item->info, format, (Adc16_Value*100)/BAT_ADC_NOR_VALUE, "DC");
	data_item->status = INFO;
	return AT_RET_OK;
}

/*
*hao.yunran
*2017.1.6
*
*/
u32_t update_bat_voltage(DATA_INFO *data_info, DATA_ITEM_STRUCT *data_item)
{
	u32_t ret = AT_RET_OK;

	return ret;
}

/*
*hao.yunran
*2017.1.6
*
*/
u32_t update_power_supply_mode(DATA_INFO *data_info, DATA_ITEM_STRUCT *data_item)
{
	u32_t ret = AT_RET_OK;

	return ret;
}

/*
*hao.yunran
*2017.1.6
*dial GPRS, if successful, we start LCP Config
*/
u32_t ppp_check_status()
{
	if(ppp_gprs_info.ppp_negotiate_result != PPP_NEGOTIATE_OK)
	{
		PR_INFO("PPP error!\r\n");		
		vTaskDelay(PPP_DIAL_TIMEOUT);
		return ERR_TIMEOUT;
	}
	return ERR_OK;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
void BAT_adc_init()
{
    adc16_config_t adc16ConfigStruct;
    adc16_channel_config_t adc16ChannelConfigStruct;

	ADC16_GetDefaultConfig(&adc16ConfigStruct);
	ADC16_Init(K24_ADC16_BASE, &adc16ConfigStruct);
	ADC16_EnableHardwareTrigger(K24_ADC16_BASE, false); /* Make sure the software trigger is used. */
	if (kStatus_Success == ADC16_DoAutoCalibration(K24_ADC16_BASE))
	{
		PRINTF("..ADC16_DoAutoCalibration().Done.\r\n");
	}
	else
	{
		PRINTF("..ADC16_DoAutoCalibration().Failed.\r\n");
	}
		adc16ChannelConfigStruct.channelNumber = K24_ADC16_USER_CHANNEL;
		adc16ChannelConfigStruct.enableInterruptOnConversionCompleted = false; /* Enable the interrupt. */
		adc16ChannelConfigStruct.enableDifferentialConversion = false;
        ADC16_SetChannelConfig(K24_ADC16_BASE, K24_ADC16_CHANNEL_GROUP, &adc16ChannelConfigStruct);
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t BAT_adc_read()
{
	volatile u32_t Adc16ConversionValue;
	
    adc16_channel_config_t adc16ChannelConfigStruct;
	adc16ChannelConfigStruct.channelNumber = K24_ADC16_USER_CHANNEL;
	adc16ChannelConfigStruct.enableInterruptOnConversionCompleted = false; /* Enable the interrupt. */
	adc16ChannelConfigStruct.enableDifferentialConversion = false;

	ADC16_SetChannelConfig(K24_ADC16_BASE, K24_ADC16_CHANNEL_GROUP, &adc16ChannelConfigStruct);
	Adc16ConversionValue = ADC16_GetChannelConversionValue(K24_ADC16_BASE, K24_ADC16_CHANNEL_GROUP);	
	//PRINTF("^_^ADC value=0x%x\n",Adc16ConversionValue);
	return Adc16ConversionValue;
}

u32_t send_bat_status(uint32_t status,int p,char *data_str)
{
	//u32_t i;
	char data[20];
	memset(data, 0, 20);
	
	strncpy(data, data_str, strlen(data_str));
	PRINTF("0 %s \r\n",data);

	hbb_send_uplink_data(hbb_info.config.id, status,  p, "%s", data);

	return 0;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t enable_sos_sms_interrupt()
{
	GPIO_ClearPinsInterruptFlags(MODEM_SOS_GPIO, 1U << MODEM_SOS_GPIO_PIN);
	EnableIRQ(MODEM_SOS_IRQ);
	GPIO_ClearPinsInterruptFlags(MODEM_RING_SMS_GPIO, 1U << MODEM_RING_SMS_GPIO_PIN);
	EnableIRQ(MODEM_RING_SMS_IRQ);
	return AT_RET_OK;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t set_all_param_to_data_mode()
{
	sos_incoming_call_status = NO_CALL;
	ppp_gprs_info.modem_need_at_mode = 0;
	ppp_gprs_info.irq_for_sos_call = SOS_NO_CALL;
	ppp_gprs_info.irq_for_sms_or_incoming_call = NO_SMS_OR_INCOMING_CALL;
	return AT_RET_OK;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_turn_at_mode_wait_uart_ready(u32_t timeout)
{
	at_ret ret = AT_RET_FAIL;		
	u32_t dcd_value = 0;
	u32_t to_at_timeout = 1600;
	u32_t at_delay_timeout = 1200;
	u32_t time = xTaskGetTickCount();//get_sys_tick();
	//UART_RTOS_Receive_NoBlocking(&ppp_handle, buf_ppp, sizeof(buf_ppp));

	PRINTF("..turn_at_mode_wait_uart_ready..\r\n");	
	dcd_value = MODEM_DCD_READ();
	ppp_gprs_info.modem_need_at_mode = 1;
	if(dcd_value == 1)
	{
		ret = AT_RET_OK;
	}
	else
	{
		while((xTaskGetTickCount() - time) < to_at_timeout)
		{		
			if(SOS_CALL_HAND_UP == ppp_gprs_info.irq_for_sos_call)
			{	
				DisableIRQ(MODEM_SOS_IRQ);
				return AT_RET_SOS_CALL_DOWN;
			}
			else
			{
				vTaskDelay(100);
			}
		}
		
		modem_at_cmd_plus(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);

		time = xTaskGetTickCount();
		while((xTaskGetTickCount() - time) < at_delay_timeout)
		{
			if(SOS_CALL_HAND_UP == ppp_gprs_info.irq_for_sos_call)
			{	
				DisableIRQ(MODEM_SOS_IRQ);
				return AT_RET_SOS_CALL_DOWN;
			}
			else
			{
				vTaskDelay(100);
			}
		}	
		
		ret = modem_at_cmd_at(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);
		if(ret != AT_RET_OK)
		{
			PRINTF("..not.change.to.at..\r\n");
			return AT_RET_FAIL;
		}
		else if(ret == AT_RET_OK)
		{
			time = xTaskGetTickCount();
			while((xTaskGetTickCount() - time) < (timeout*1000))
			{
				if(pdFALSE == xSemaphoreTake(ppp_handle.rx_sem, 0U))
				{			
					PRINTF("..uart.rx_sem.used_now..\r\n");
					vTaskDelay(100);
					ret = AT_RET_FAIL;
				}
				else
				{				
					ret = AT_RET_OK;
					break;
				}
			}
			if(ret == AT_RET_OK)
			{
				xSemaphoreGive(ppp_handle.rx_sem);				
				PRINTF("..sem ready..\r\n"); 
			}
			else
			{
				xSemaphoreGive(ppp_handle.rx_sem);				
			}
		}
	}
	//PRINTF("..hh4....................%d\r\n",ret);
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_incoming_call_auto_answer()
{
	u32_t ret = AT_RET_OK;
	ret = modem_at_cmd_ata(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);
	if(ret != AT_RET_OK)
	{
		PRINTF(".at cmd fail.\r\n");
	}
	ret = modem_wait_incoming_call_end_clcc(&ppp_handle);
	switch(ret)
	{	
			// the one who makes incoming call hands up the call
		case AT_RET_CALL_DOWN:   
			PRINTF(".incoming_call.end.\r\n");
			vTaskDelay(50);
			modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
			vTaskDelay(50);
			ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, WAIT_RETURN);
			if(ret != AT_RET_OK)
			{
				PRINTF(".ato cmd fail.\r\n");
			}
			else
			{
				PRINTF(".back_to_data_mode.\n");
			}
			break;
			// press sos key to hand up the call
		case AT_RET_SOS_CALL_UP:
			//the calling time is too long to timeout
		case AT_RET_CALL_DOWN_TIMER_OUT:
			if(ret == AT_RET_SOS_CALL_UP)
			{
				PRINTF(".press_key_end_incoming_call.\r\n");
			}
			else
			{
				PRINTF(".incoming_call.timeout.\n");
			}
			vTaskDelay(50);
			ret = modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, WAIT_RETURN);
			if(ret != AT_RET_OK)
			{
				PRINTF(".chup cmd fail.\r\n");
			}
			vTaskDelay(50);
			ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, WAIT_RETURN);
			if(ret != AT_RET_OK)
			{
				PRINTF(".ato cmd fail.\r\n");			
			}
			else
			{
				PRINTF(".back_to_data_mode.\n");
			}
			break;

		default:
			PRINTF(".incoming_call.end.\n");
			vTaskDelay(50);
			modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
			vTaskDelay(50);
			ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);
			if(ret != AT_RET_OK)
			{
				PRINTF(".ato cmd fail.\r\n");			
			}
			else
			{
				PRINTF(".back_to_data_mode.\n");
			}
			break;

