ywtgogo/sd_mk24n256/project_wifi/protocol/uart_ppp.c
	}
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_incoming_call_press_key_answer()
{
	u32_t ret = AT_RET_OK;
	ppp_gprs_info.irq_for_sos_call = SOS_NO_CALL;
	PRINTF(".press_key_answer.\r\n");
	ret = modem_at_cmd_ata(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);
	if(ret != AT_RET_OK)
	{
		PRINTF(".at cmd fail.\r\n");
	}
	vTaskDelay(50);
	ret = modem_wait_incoming_call_end_clcc(&ppp_handle);
	switch(ret)
	{	
			// the one who makes incoming call hands up the call
		case AT_RET_CALL_DOWN:
			PRINTF(".incoming_call.end.by.caller.\r\n");
			vTaskDelay(50);
			modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
			vTaskDelay(50);
			ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, WAIT_RETURN);
			if(ret != AT_RET_OK)
			{
				PRINTF(".ato cmd fail.\r\n");
			}
			else
			{
				PRINTF(".back_to_data_mode.\n");
			}
			break;
			// press sos key to hand up the call
		case AT_RET_SOS_CALL_UP:
			// the call is timeout
		case AT_RET_CALL_DOWN_TIMER_OUT:
			if(ret == AT_RET_SOS_CALL_UP)
			{
				PRINTF(".press_key_end_incoming_call.\n");
			}
			else
			{
				PRINTF(".incoming_call.timeout.\n");
			}
			vTaskDelay(50);
			ret = modem_at_cmd_chup(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);
			if(ret != AT_RET_OK)
			{
				PRINTF(".chup cmd fail.\r\n");
			}
			vTaskDelay(50);
			ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);
			if(ret != AT_RET_OK)
			{
				PRINTF(".ato cmd fail.\r\n");
			}
			else
			{
				PRINTF(".back_to_data_mode.\n");
			}
			break;
			
		default :
			PRINTF(".incoming_call.end.\r\n");
			vTaskDelay(50);
			modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
			vTaskDelay(50);
			ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, WAIT_RETURN);
			if(ret != AT_RET_OK)
			{
				PRINTF(".ato cmd fail.\r\n");
			}
			else
			{
				PRINTF(".back_to_data_mode.\n");
			}
			break;

	}

	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_incoming_call_hand_up_by_caller()
{
	u32_t ret = AT_RET_OK;
	PRINTF(".incoming_call.hand_up.by_caller.\r\n");
	modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
	vTaskDelay(50);
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, WAIT_RETURN);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_incoming_call_mode_change_fail()
{
	u32_t ret = AT_RET_OK;
	modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
	PRINTF(".incoming_call.hand_up_mode change fail.\n");
	vTaskDelay(50);
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, NOT_WAIT);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	SPKR_OFF();
	set_all_param_to_data_mode();
	defer_log_uplink(); 	
	PRINTF("..cannot.turn_at.or.sem_fail..\r\n");			
	enable_sos_sms_interrupt();
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_incoming_call_hand_up_default()
{
	u32_t ret = AT_RET_OK;
	PRINTF(".incoming_call.end.default.\r\n");
	vTaskDelay(50);
	modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
	vTaskDelay(50);
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, NOT_WAIT);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sms_apn_analyse()
{
	at_ret ret = AT_RET_OK;		
	//u32_t sms_numb = 0;

	PR_INFO("..update_apn..\r\n");
	memset(&ppp_gprs_apn_pap_info.gprs_apn, 0, sizeof(ppp_gprs_apn_pap_info.gprs_apn));
	memset(&ppp_gprs_apn_pap_info.ppp_pap_user, 0, sizeof(ppp_gprs_apn_pap_info.ppp_pap_user));
	memset(&ppp_gprs_apn_pap_info.ppp_pap_passwd, 0, sizeof(ppp_gprs_apn_pap_info.ppp_pap_passwd));
	
	strncpy(ppp_gprs_apn_pap_info.gprs_apn, ppp_gprs_info.gprs_apn, sizeof(ppp_gprs_info.gprs_apn));
	strncpy(ppp_gprs_apn_pap_info.ppp_pap_user, ppp_gprs_info.ppp_pap_user, sizeof(ppp_gprs_info.ppp_pap_user));
	strncpy(ppp_gprs_apn_pap_info.ppp_pap_passwd, ppp_gprs_info.ppp_pap_passwd, sizeof(ppp_gprs_info.ppp_pap_passwd));				
	if((ppp_gprs_info.sms_current_number_me+MAX_MARGIN_SMS_NUMB_ME) >= ppp_gprs_info.sms_max_number_me)
	{
		vTaskDelay(60);
		ret = modem_at_cmd_cmgd_all(&ppp_handle, AT_REPEAT_MIN, AT_DELET_SMS_TIMEOUT_MAX, WAIT_RETURN);
	    if(ret != AT_RET_OK)
	    {
			PRINTF(".delete sms all fail.\r\n");
	    }
		vTaskDelay(60);
	}
	ret = modem_at_cmd_cnmi(&ppp_handle, AT_REPEAT_MIN, AT_TIMEOUT_MAX, NOT_WAIT);
	vTaskDelay(60);
	ppp_gprs_apn_pap_info.sms_curr_number_me = 1;
	ppp_gprs_apn_pap_info.sms_max_number_me = ppp_gprs_info.sms_max_number_me;		
	sync_gprs_info();
	ret = AT_RET_OK;
	ppp_gprs_info.modem_need_apn_update = 1;
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sms_sos_analyse()
{
	at_ret ret = AT_RET_OK;		
	//u32_t sms_numb = 0;

	PR_INFO("..update_sos..\r\n");
	memset(&ppp_gprs_apn_pap_info.sos_call, 0, sizeof(ppp_gprs_apn_pap_info.sos_call));
	strncpy(ppp_gprs_apn_pap_info.sos_call, ppp_gprs_info.sos_call, sizeof(ppp_gprs_info.sos_call));
	if((ppp_gprs_info.sms_current_number_me+MAX_MARGIN_SMS_NUMB_ME) >= ppp_gprs_info.sms_max_number_me)
	{
		vTaskDelay(60);
		ret = modem_at_cmd_cmgd_all(&ppp_handle, AT_REPEAT_MIN, AT_DELET_SMS_TIMEOUT_MAX, WAIT_RETURN);
	    if(ret != AT_RET_OK)
	    {
			PRINTF(".delete sms all fail.\r\n");
	    }
		vTaskDelay(60);
	}
	ret = modem_at_cmd_cnmi(&ppp_handle, AT_REPEAT_MIN, AT_TIMEOUT_MAX, NOT_WAIT);
	vTaskDelay(60);
	ppp_gprs_apn_pap_info.sms_curr_number_me = 1;
	ppp_gprs_apn_pap_info.sms_max_number_me = ppp_gprs_info.sms_max_number_me;		
	//sync_gprs_info(); 						
	//sos_len = strlen(ppp_gprs_info.sos_call);
	memset(&at_cmd_sos_call, 0, sizeof(at_cmd_sos_call));				
	sprintf(at_cmd_sos_call,"ATD%s\r", ppp_gprs_info.sos_call); 			
	PRINTF(".sms.sos.%s\n",at_cmd_sos_call);
	
