ywtgogo/sd_mk24n256/project_wifi/protocol/uart_ppp.c
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_NOR, WAIT_RETURN);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	sync_gprs_info();
	ret = AT_RET_OK;	
	PRINTF(".sms.sos.end\n");	
	ppp_gprs_info.modem_need_sos_update = 1;
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sms_process_default()
{
	at_ret ret = AT_RET_OK;		
	//u32_t sms_numb = 0;

	PRINTF("..no_apn_sos_update..\r\n");
	if((ppp_gprs_info.sms_current_number_me+MAX_MARGIN_SMS_NUMB_ME) >= ppp_gprs_info.sms_max_number_me)
	{
		#if 0
		sms_numb = ppp_gprs_info.sms_current_number_me;
		for(; sms_numb > 0; sms_numb--)
		{
			modem_sms_delete(sms_numb);			
			vTaskDelay(60);
		}
		#endif
		vTaskDelay(60);
		ret = modem_at_cmd_cmgd_all(&ppp_handle, AT_REPEAT_MIN, AT_DELET_SMS_TIMEOUT_MAX, WAIT_RETURN);
	    if(ret != AT_RET_OK)
	    {
			PRINTF(".delete sms all fail.\r\n");
	    }
		vTaskDelay(60);
	}
	modem_at_cmd_cnmi(&ppp_handle, AT_REPEAT_MIN, AT_TIMEOUT_MAX, NOT_WAIT);
	vTaskDelay(60);
	ppp_gprs_apn_pap_info.sms_curr_number_me = 1;
	ppp_gprs_apn_pap_info.sms_max_number_me = ppp_gprs_info.sms_max_number_me;		
	sync_gprs_info();
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_NOR, WAIT_RETURN);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	return AT_RET_OK;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sos_call_hand_up_by_caller()
{
	u32_t ret = AT_RET_OK;
	PRINTF(".sos_call.press_key_hand_up.\n");
	ret = modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, NOT_WAIT);
	if(ret == AT_RET_OK)
	{
		
	}
	vTaskDelay(50);
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, WAIT_RETURN);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sos_call_hand_up_by_answer()
{
	u32_t ret = AT_RET_OK;
	PRINTF(".sos_call.end.by.answer.\n");
	modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
	vTaskDelay(50);
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, WAIT_RETURN);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sos_call_hand_up_by_timeout()
{
	u32_t ret = AT_RET_OK;
	PRINTF(".sos_call.end.timeout.\n");
	modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, NOT_WAIT);
	vTaskDelay(50);
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, WAIT_RETURN);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sos_call_hand_up_during_wait_uart()
{
	u32_t ret = AT_RET_OK;
	modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, NOT_WAIT);
	vTaskDelay(50);
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, NOT_WAIT);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	set_all_param_to_data_mode();
	defer_log_uplink();
	PRINTF("..sos_call_hand_up_during_wait_uart..\r\n");			
	enable_sos_sms_interrupt();
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sos_call_mode_change_fail()
{
	u32_t ret = AT_RET_OK;
	modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
	PRINTF(".sos_call.hand_up_mode_change_fail.\n");
	vTaskDelay(50);
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, NOT_WAIT);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	defer_log_uplink(); 
	SPKR_OFF();
	set_all_param_to_data_mode();
	PRINTF("..cannot.turn_at.or.sem_fail..\r\n");	
	enable_sos_sms_interrupt();
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sos_call_hand_up_default()
{
	u32_t ret = AT_RET_OK;
	modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
	PRINTF(".sos_call.hand_up_default.\n");
	vTaskDelay(50);
	ret = modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_NOR, NOT_WAIT);
	if(ret != AT_RET_OK)
	{
		PRINTF(".ato cmd fail.\r\n");
	}
	else
	{
		PRINTF(".back_to_data_mode.\n");
	}
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t gsm_sos_call_cmd_fail()
{
	u32_t ret = AT_RET_OK;
	PRINTF(".sos_call.send error.\n");
	modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
	vTaskDelay(50);
	modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t ppp_uart_receive_fail(u32_t error)
{
	at_ret ret = AT_RET_OK;		

	if (error == kStatus_UART_RxHardwareOverrun)
	{
		/* Notify about hardware buffer overrun */
		if (kStatus_Success != UART_RTOS_Send(&ppp_handle, (uint8_t *)send_hardware_overrun, strlen(send_hardware_overrun)))
		{
			PRINTF("RxHardwareOverrun PPP\r\n");
			ret = AT_RET_FAIL;	
		}
	}
	if (error == kStatus_UART_RxRingBufferOverrun)
	{
		/* Notify about ring buffer overrun */
		if (kStatus_Success != UART_RTOS_Send(&ppp_handle, (uint8_t *)send_ring_overrun, strlen(send_ring_overrun)))
		{
			PRINTF("RxRingBufferOverrun PPP\r\n");
			ret = AT_RET_FAIL;
		}
	}
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t mcu_uart_io_init()
{
	u32_t ret = AT_RET_OK;
	PRINTF("\r\n^_^seq001.ppp init\r\n");
	ppp_gprs_info.ppp_gprs_current_seq = SEQ_001;
	PPP_GREEN_LED_INIT();
	//PPP_GREEN_LED_OFF();
	PPP_RED_LED_INIT();
	//PPP_RED_LED_OFF();	
	MODEM_POWER_INIT();
	MODEM_EMERG_RST_INIT();
#if (BOARD_NAME == HW_V02)
	//K24_POWER_LED_INIT(); 
	//K24_POWER_LED_ON();
#endif
	MODEM_DCD_INIT();
	SPKR_SWT_GPIO_INIT();
	SPKR_SWT_OFF();
	SPKR_GPIO_INIT();
	SPKR_OFF();
	//MODEM_RING_INIT();
	modem_uart_config.srcclk = CLOCK_GetFreq(MODEM_UART_CLKSRC);
	modem_uart_config.base = MODEM_UART;
    NVIC_SetPriority(MODEM_UART_RX_TX_IRQn, 6);

    if (0 > UART_RTOS_Init(&ppp_handle, &ppp_t_handle, &modem_uart_config))
    {
        PRINTF("Error during UART initialization.\r\n");
        //vTaskSuspend(NULL);
        ret = AT_RET_FAIL;
    }
    //lwip_init();
	//tcpip_init(NULL, NULL);
    //pppInit();

