ywtgogo/sd_mk24n256/project_wifi/protocol/uart_ppp.c
    MODEM_RING_SMS_INIT();
	Modem_Ring_Sms_Irq_Init();	 
	MODEM_SOS_INIT();
	Modem_SOS_Irq_Init();
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t sms_update_or_ring_proc()
{
	FOTA_RQ_MSG msg;
    u32_t ret = AT_RET_OK;
	PRINTF("\r\n^_^seq009.sms_ring\r\n");
	if(pdFALSE == xSemaphoreTake(call_http_mqtt_sem, 1600U))
	{
		PRINTF(".sms_ring.take.sem.fail.\r\n");
		set_all_param_to_data_mode();
		enable_sos_sms_interrupt();
		return AT_RET_FAIL;
	}
	ret = gsm_turn_at_mode_wait_uart_ready(MODEM_MODE_SWITCH_TIMEOUT);	
	if(ret != AT_RET_OK)
	{
		gsm_incoming_call_mode_change_fail();	
		xSemaphoreGive(call_http_mqtt_sem);
		return AT_RET_FAIL;
	}
	if(ppp_gprs_info.irq_for_sms_or_incoming_call == SMS_OR_INCOMING_CALL)
	{
		PRINTF("..sms.or.incoming_call..\r\n"); 
		ret = modem_at_cmd_cpms_incomingcall(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);
		//ret = modem_at_cmd_clcc(&ppp_handle, AT_REPEAT_NOR, AT_CLCC_TIMEOUT_NOR, WAIT_RETURN);
		if(ret == AT_RET_CALL_ING)
		{
			ppp_gprs_info.irq_for_sms_or_incoming_call = INCOMING_CALL_IRQ;
		}
		else if(ret == AT_RET_OK)
		{
			ppp_gprs_info.irq_for_sms_or_incoming_call = SMS_NEED_UPDATE;
		}
		else
		{
			gsm_incoming_call_mode_change_fail();	
			xSemaphoreGive(call_http_mqtt_sem);
			return AT_RET_FAIL;
		}
		if((ppp_gprs_info.irq_for_sms_or_incoming_call == INCOMING_CALL_IRQ)
			&&(NOT_SUPPORT_INCOMING_CALL == ppp_gprs_apn_pap_info.incoming_call_answer_timeout))
		{
			modem_at_cmd_chup(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
			vTaskDelay(50);
			modem_at_cmd_ato(&ppp_handle, AT_REPEAT_NOR, AT_TIMEOUT_MAX, NOT_WAIT);
			PRINTF(".back_to_data_mode.\n");
			SPKR_OFF();
			set_all_param_to_data_mode();
			enable_sos_sms_interrupt();
			xSemaphoreGive(call_http_mqtt_sem);
			return AT_RET_FAIL;
		}
		else if((ppp_gprs_info.irq_for_sms_or_incoming_call == INCOMING_CALL_IRQ)
			&&(NOT_SUPPORT_INCOMING_CALL != ppp_gprs_apn_pap_info.incoming_call_answer_timeout))
		{					
			PPP_GREEN_LED_OFF();
			PPP_RED_LED_ON();
			msg.cmd = FW_SOS_INCOMING_CALL;
			xQueueSend(fota_rq_handle, &msg, 0);
			sos_incoming_call_status = CALL_ING;
			ppp_gprs_info.irq_for_sos_call = SOS_NO_CALL;
		    SPKR_ON();
			AUDIO_MSG_2G();
			GPIO_ClearPinsInterruptFlags(MODEM_SOS_GPIO, 1U << MODEM_SOS_GPIO_PIN);
			EnableIRQ(MODEM_SOS_IRQ);
			PR_INFO(".incoming_call.\r\n");	
			vTaskDelay(50);
			ret = modem_wait_incoming_call_answer_clcc(&ppp_handle);
			// 30s timeout pass, now ata call auto
			if(ret == AT_RET_CALL_DOWN_TIMER_OUT) 
			{
				gsm_incoming_call_auto_answer();
			}
			// press sos key to answer incoming call
			else if(ret == AT_RET_SOS_CALL_UP)
			{
				gsm_incoming_call_press_key_answer();
			}
			//the one who makes incoming call hands up the call
			else if(ret == AT_RET_CALL_DOWN)
			{
				gsm_incoming_call_hand_up_by_caller();
			}
			else
			{
				gsm_incoming_call_hand_up_default();
			}	
			defer_log_uplink();
			SPKR_OFF();
			set_all_param_to_data_mode();
			enable_sos_sms_interrupt();
			xSemaphoreGive(call_http_mqtt_sem);
			return AT_RET_OK;
		}
		else if(ppp_gprs_info.irq_for_sms_or_incoming_call == SMS_NEED_UPDATE)
		{			
			PRINTF("..this sms..\r\n");
			ret = modem_at_cmd_cpms(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);
			if(ret != AT_RET_OK)
			{
			
			}	
			vTaskDelay(60);
			//get apn from sms with new sms, if get it, turn to reset km. if get it fail, continue
			ret = modem_get_gprs_apn();
			if(ret == AT_RET_OK)
			{	
				//PRINTF("..this sms1..0x%x\r\n",seq_func_g);
				ret = gsm_sms_apn_analyse();
			}	
			//check sms for sos
			else
			{
				PR_INFO("..update_sos..\r\n");
				//UART_RTOS_Receive_NoBlocking(&ppp_handle, buf_ppp, sizeof(buf_ppp));
				ret = modem_get_sos_call_numb();
				if(ret == AT_RET_OK)
				{									
					ret = gsm_sms_sos_analyse();
				}	
				else
				{
					ret = gsm_sms_process_default();
				}
			}
		}
		else 
		{
			PRINTF("..read sms fail..\r\n");
		}		
		defer_log_uplink();
		set_all_param_to_data_mode();
		enable_sos_sms_interrupt();
		xSemaphoreGive(call_http_mqtt_sem);
		return AT_RET_OK;
	}
	else
	{
		defer_log_uplink();
		set_all_param_to_data_mode();
		enable_sos_sms_interrupt();
		xSemaphoreGive(call_http_mqtt_sem);
		return AT_RET_FAIL;
	}
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t sos_call_proc()
{
	FOTA_RQ_MSG msg;
    u32_t ret = AT_RET_OK;
	PRINTF("\r\n^_^seq010.sos call\r\n");
	if(pdFALSE == xSemaphoreTake(call_http_mqtt_sem, 1600U))
	{
		PRINTF("..sos take sem fail......\r\n");
		set_all_param_to_data_mode();
		enable_sos_sms_interrupt();
		return AT_RET_FAIL;
	}

	ret = gsm_turn_at_mode_wait_uart_ready(MODEM_MODE_SWITCH_TIMEOUT);	
	PRINTF("..uart sta..%d\r\n",ret);
	if(ret == AT_RET_FAIL)
	{
		gsm_sos_call_mode_change_fail();	
		xSemaphoreGive(call_http_mqtt_sem);
		return AT_RET_FAIL;
	}
	if(ret == AT_RET_SOS_CALL_DOWN)
	{
		gsm_sos_call_hand_up_during_wait_uart();		
		xSemaphoreGive(call_http_mqtt_sem);
		return AT_RET_OK;
	}
	
	if(ppp_gprs_info.irq_for_sos_call == SOS_CALL_IRQ)
	{	
		PR_INFO("..sos_call_ing..\r\n");
		SPKR_ON();
		AUDIO_MSG_2G();
		vTaskDelay(50);
		msg.cmd = FW_SOS_INCOMING_CALL;
		xQueueSend(fota_rq_handle, &msg, 0);
		sos_incoming_call_status = CALL_ING;
		ret = modem_at_cmd_sos(&ppp_handle, AT_REPEAT_MAX, AT_TIMEOUT_MAX, WAIT_RETURN);
		GPIO_ClearPinsInterruptFlags(MODEM_SOS_GPIO, 1U << MODEM_SOS_GPIO_PIN);
		EnableIRQ(MODEM_SOS_IRQ);
		/*atd sos call is calling*/
		if(ret == AT_RET_OK)
		{
			/* wait for sos call end and wait for irq of hand up */
			ret = modem_wait_sos_call_end_clcc(&ppp_handle);
			/* sos call timeout and end */
			if(ret == AT_RET_CALL_DOWN_TIMER_OUT)
			{
				gsm_sos_call_hand_up_by_timeout();
			}
			/* sos call end by press sos key */
			else if(ret == AT_RET_SOS_CALL_DOWN)
			{
				gsm_sos_call_hand_up_by_caller();
			}
			/* sos call end by anwser */
			else if(ret == AT_RET_CALL_DOWN)
			{
				gsm_sos_call_hand_up_by_answer();
			}
			else
			{
				gsm_sos_call_hand_up_default();
			}
		}
		else
		{
			gsm_sos_call_cmd_fail();
		}
		
		//PRINTF("hh..sos_call..3\n");
	}
	//PRINTF("..tt1..........%d\r\n",ppp_gprs_info.irq_for_sos_call);
	defer_log_uplink();
	SPKR_OFF();
	set_all_param_to_data_mode();
	enable_sos_sms_interrupt();
	xSemaphoreGive(call_http_mqtt_sem);
	return AT_RET_OK;
}

