ywtgogo/sd_mk24n256/project_wifi/protocol/uart_ppp.c
/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t modem_status_idle()
{
	u32_t ret = AT_RET_OK;
	
	PRINTF("\r\n^_^seq008..idle\r\n");
	ppp_gprs_info.ppp_gprs_current_seq = SEQ_008;
	PR_INFO("..modem_status_idle..\r\n");
	while(1)
	{
		if(ppp_gprs_info.http_ask_ppp_to_negotiate == 1)
		{
			set_lwip_link_state(PPP_NEGOTIATE);
			return ret;
		}
		if(ppp_gprs_info.modem_need_apn_update == 1)
		{
			ppp_gprs_info.modem_need_apn_update = 0;
			//sync_gprs_info();
			ret = AT_RET_APN_UPDATE;
			return ret;
		}
		if(SOS_CALL_IRQ == ppp_gprs_info.irq_for_sos_call)
		{
			PPP_RED_LED_ON();
			PPP_GREEN_LED_OFF();
			return AT_RET_SOS_CALL_UP;
		}
		if(SMS_OR_INCOMING_CALL == ppp_gprs_info.irq_for_sms_or_incoming_call)
		{
			//PPP_RED_LED_ON();
			//PPP_GREEN_LED_OFF();
			return AT_RET_SMS_UPDATE_RING;
		}
		vTaskDelay(1000);

	}
	return ret;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/

u32_t seq_state_execute( SEQ_TBL  * const seq_func)
{
	u32_t result = SEQ_EX_OK;
	u32_t next_seq = NEXT_SEQ_001;
	//SEQ_TBL  *seq_func_p = seq_func;
	seq_func_g = seq_func;
	//PRINTF("....seq_func0..0x%x..0x%x\r\n",seq_func_p, seq_func);
	//PRINTF("..seq_func1....0x%x..\r\n",seq_func);
	result = seq_func->func(); 
	//PRINTF("....seq_func1..0x%x..0x%x\r\n",seq_func_p, seq_func);
	
	PRINTF("..seq ret.%d..\r\n",result);
	switch(result)
	{
		case SEQ_EX_OK:
			next_seq = NEXT_SEQ_001;
			//PRINTF("^_^next_seq.....%d\n",next_seq);
			break;

		case SEQ_EX_ERR:
			#if 0
			if(seq_func->seq_repeat_count == 0x0)
			{
				next_seq = NEXT_SEQ_002;
			}
			else
			{		
				seq_func->seq_repeat_count--;
				next_seq = NEXT_SEQ_003;
			}
			#endif
			next_seq = NEXT_SEQ_002;
			break;
		
		case SEQ_EX_REPEAT:
			break;
			
		case SEQ_EX_ERR_HTTP:
			next_seq = NEXT_SEQ_005;
			break;	
			
		case SEQ_EX_APN_UPDATE:
			next_seq = NEXT_SEQ_005;
			break;	
			
		case SEQ_EX_SMS_UPDATE_RING:
			next_seq = NEXT_SEQ_003;
			break;
			
		case SEQ_EX_SOS_CALL_UP:
			next_seq = NEXT_SEQ_004;
			break;
			
		case SEQ_EX_NEXT_SEQ3:
			next_seq = NEXT_SEQ_003;
			break;
			
		case SEQ_EX_NEXT_SEQ4:
			next_seq = NEXT_SEQ_004;
			break;
			
		case SEQ_EX_NEXT_SEQ5:
			next_seq = NEXT_SEQ_005;
			break;
			
		case SEQ_EX_PPP_DOWN:
			next_seq = NEXT_SEQ_005;
			break;
			
		case SEQ_EX_END:
			next_seq = NEXT_SEQ_005;
			break;
				
		default:

			break;
	}
	//PRINTF("^_^seq_state_execute...next_seq..%d,0x%x\n",next_seq,seq_func);
	//PRINTF("..seq ret.%d.next_seq.%d..\r\n",result,next_seq);	
	PRINTF("seq_func.0x%x.0x%x\r\n",seq_func_g, seq_func);	
	next_seq_no = seq_func_g->next_states_no[next_seq];
	//PRINTF("...next_seq_no..0x%x\n",next_seq_no);	
	return result;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
u32_t ppp_state_machine(SEQ_TBL  *seq_func)
{
	u32_t result = SEQ_EX_OK; 
	//volatile SEQ_TBL  *seq_func_point = seq_func;
	while(1)
	{
		//PRINTF("..seq_func.............0x%x..next_seq_no=%d\r\n",seq_func, next_seq_no);
		result = seq_state_execute(seq_func + next_seq_no); 
		if(result == SEQ_EX_INIT_END)
		{
			break;
		}
	}
	return result;
}

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
SEQ_TBL ppp_state_func[]={
	/*                                                            next_seq1     next_seq2     next_seq3     next_seq4    next_seq5        status  repeat    curr_seq_numb*/
	/*                                                            case1-ok      case2-err     case3         case4        case5-end                                             */
    {mcu_uart_io_init,	 	     { {0x0} }, { SEQ_002, SEQ_001, SEQ_008, SEQ_008, SEQ_008 }, 0x0, 0x1}, /* SEQ_001 */  /* return ok/fail */
	{gprs_modem_init,		     { {0x0} }, { SEQ_003, SEQ_002, SEQ_002, SEQ_008, SEQ_008 }, 0x0, 0xF}, /* SEQ_002 */  /* return ok/fail */
	{gprs_check_sim,	         { {0x0} }, { SEQ_004, SEQ_002, SEQ_008, SEQ_008, SEQ_008 }, 0x0, 0x0}, /* SEQ_003 */  /* return ok/fail */
	{gprs_set_sms_storage,       { {0x0} }, { SEQ_005, SEQ_002, SEQ_008, SEQ_008, SEQ_008 }, 0x0, 0x0}, /* SEQ_004 */  /* return ok/fail */
	{gprs_get_gprs_sign,         { {0x0} }, { SEQ_006, SEQ_002, SEQ_008, SEQ_008, SEQ_008 }, 0x0, 0x0}, /* SEQ_005 */  /* return ok/fail */
	{gprs_get_gprs_status,       { {0x0} }, { SEQ_007, SEQ_002, SEQ_008, SEQ_008, SEQ_008 }, 0x0, 0x0}, /* SEQ_006 */  /* return ok/fail */
	{gprs_call_gprs,	     	 { {0x0} }, { SEQ_008, SEQ_002, SEQ_008, SEQ_008, SEQ_008 }, 0x0, 0x0}, /* SEQ_007 */  /* return ok/fail */
	{modem_status_idle,			 { {0x0} }, { SEQ_008, SEQ_008, SEQ_009, SEQ_010, SEQ_008 }, 0x0, 0x0}, /* SEQ_008 */  /* return ok/fail/apn_update/sms_ring/sos_call */
	{sms_update_or_ring_proc,	 { {0x0} }, { SEQ_008, SEQ_008, SEQ_008, SEQ_008, SEQ_008 }, 0x0, 0x0}, /* SEQ_009 */  /* return next_seq3/next_seq4 */
	{sos_call_proc,			     { {0x0} }, { SEQ_008, SEQ_008, SEQ_008, SEQ_008, SEQ_008 }, 0x0, 0x0}, /* SEQ_010 */  /* return next_seq3/next_seq4 */
};

/*
*hao.yunran
*2016.10.10
*dial GPRS, if successful, we start LCP Config
*/
void ppp_uart_task(void *pvParameters)
{
    PRINTF("pppInit\r\n");

	ppp_state_machine(ppp_state_func);

}

/*
*hao.yunran
*2017.1.19
*dial GPRS, if successful, we start LCP Config
*/
void hbb_power_status_task(void *pvParameters)
{
	u32_t Adc16_Value = 0;
	u32_t bat_volt_percent = 0;
	u32_t nPG_Value = 0;
	u32_t nCHG_Value = 0;
	char dc_v_data[16]="10201/vt:90";
	char acdc_data[12]="10302/s:AC";
	
    PRINTF("hbb_power_status_task\r\n");	
	OVERVOLTAGE_INIT();
	Power_HighV_Irq_Init();	
	BAT_nPG_INIT();
	BAT_nCHG_INIT();
	BAT_adc_init();
	Power_LowV_Init();
	while(1)
	{
		if(aging_test_for_ppp != 1)
		{
			if(ppp_gprs_info.ppp_gprs_current_seq != SEQ_008)
			{
				ppp_gprs_info.ppp_gprs_timer_counter++;
				if(ppp_gprs_info.ppp_gprs_timer_counter > K24_STATUS_COUNT_MAX)
				{
					ppp_gprs_info.ppp_gprs_current_status = K24_STATUS_DEAD;
					PR_INFO("..ppp_status_dead..\r\n");
				}
			}
			else
			{
				ppp_gprs_info.ppp_gprs_timer_counter = 0;
				ppp_gprs_info.ppp_gprs_current_status = K24_STATUS_LIVE;
			}
			PRINTF("1..\r\n");
			#if 0
			if(ppp_gprs_info.ppp_uart_old_counter == ppp_gprs_info.ppp_uart_current_counter)
			{
				ppp_gprs_info.ppp_uart_timer_counter++;
				if(ppp_gprs_info.ppp_uart_timer_counter > K24_UART_STATUS_COUNT_MAX)
				{
					ppp_gprs_info.ppp_uart_current_status = K24_UART_STATUS_DEAD;
					PR_INFO("..ppp_uart_status_dead..\r\n");
				}

