ywtgogo/sd_mk24n256/project_wifi/protocol/uart_ppp.c
			}
			else
			{
				ppp_gprs_info.ppp_uart_old_counter = ppp_gprs_info.ppp_uart_current_counter;
				ppp_gprs_info.ppp_uart_timer_counter = 0;

			}
			#endif
		}
		nPG_Value = BAT_nPG_READ();
		if(nPG_Value == 0x0)
		{	
			acdc_data[8]='D';
			Adc16_Value = BAT_adc_read();
			if(Adc16_Value < BAT_ADC_NOR_VALUE)
			{
				bat_volt_percent = (Adc16_Value*100)/BAT_ADC_NOR_VALUE;
				if(Adc16_Value < BAT_ADC_LOW_VALUE)
				{
					
					dc_v_data[9]='8';	
					if(Adc16_Value < BAT_ADC_SHUT_VALUE)
					{
						dc_v_data[10]='7';	
					}
					else
					{
						dc_v_data[10]='8';	
					}
					dc_v_data[11]='\0';
					bat_adc_counter++;
					if(bat_adc_counter > 1)
					{
						send_bat_status(WARNING,6,dc_v_data);
						bat_volt_low_flag = 1;
					}
					if(Adc16_Value < BAT_ADC_SHUT_VALUE)
					{
						dc_v_data[9]='8';			
						dc_v_data[10]='7';	
						dc_v_data[11]='\0';
						bat_adc_shut_counter++;
						if(bat_adc_shut_counter > 1)
						{
							PRINTF("..need shut down system..\r\n");			
							POWER_OFF_GPIO_INIT();
							POWER_OFF();
						}					
					}
				}
				else
				{
					bat_adc_counter = 0;
					bat_adc_shut_counter = 0;
					bat_volt_low_flag = 0;
					dc_v_data[10] = (bat_volt_percent%10) + '0';
					dc_v_data[9] = (bat_volt_percent/10) + '0';
					dc_v_data[11]='\0';
				}
				PRINTF("..dc_v_data:%s\r\n",dc_v_data);
				//send_bat_status(10,6,dc_v_data);
				PRINTF("..Adc16_Value..0x%x\r\n",Adc16_Value);		
			}
			else
			{
				bat_adc_counter = 0;
				bat_adc_shut_counter = 0;
				bat_volt_low_flag = 0;			
				dc_v_data[9]='1';
				dc_v_data[10]='0';
				dc_v_data[11]='0';			
				PRINTF("..dc_v_data:%s\r\n",dc_v_data);
				PRINTF("..Adc16_Value..0x%x\r\n",Adc16_Value);		
			}			
		}
		else
		{		
		
			acdc_data[8]='A';
		}
		if(power_ac_dc_status != nPG_Value)
		{
			power_ac_dc_status = nPG_Value;	
			send_bat_status(WARNING,6,acdc_data);
		}
		PRINTF("..acdc_data:%s\r\n",acdc_data);
		//send_bat_status(10,6,acdc_data);
		PRINTF("..nPG_Value..0x%x\r\n",nPG_Value);

		nCHG_Value = BAT_nCHG_READ();
		PRINTF("..nCHG_Value..0x%x\r\n",nCHG_Value);
		#if 0
		currentCNR = Power_LowV_Read();
		if(currentCNR == 0x0)
		{
			
		}
		else
		{

		}
		//send_bat_status(WARNING,6,ac_low_v_data);
		PRINTF("..currentCNR..0x%x\r\n",currentCNR);
		#endif
		vTaskDelay(HBB_POWER_CHECK_INTERVAL);
	}

}



#endif










